Limpieza y preparación de datos

Tratamiento de los datos que faltan

In [2]:
import pandas as pd
import numpy as np
float_data = pd.Series([6.9, 0, -7.4, np.nan, 0])

In [3]:
float_data

0    6.9
1    0.0
2   -7.4
3    NaN
4    0.0
dtype: float64

El método isna nos da una serie Booleana con True donde los valores son 'nulos'.

In [4]:
float_data.isna()

0    False
1    False
2    False
3     True
4    False
dtype: bool

Lenguje de programación R refiriéndoce  a los datos perdidos como NA que significa no disponible(Not Avalible)

In [5]:
string_data =pd.Series (['pedro','juan', None, 'carlos', np.nan ])
string_data

0     pedro
1      juan
2      None
3    carlos
4       NaN
dtype: object

In [6]:
string_data.isna()

0    False
1    False
2     True
3    False
4     True
dtype: bool

isna nos da una serie Booleana con True donde son Nulos los valores

In [7]:
float_data = pd.Series([25, 10 , 8, None, 5], dtype='float64')
float_data

0    25.0
1    10.0
2     8.0
3     NaN
4     5.0
dtype: float64

In [9]:
float_data.isna()

0    False
1    False
2    False
3     True
4    False
dtype: bool

Se crea una DataFrame para mirar otros métodos como: Dropna que se utiliza para eliminar filas o columnas que contienen valores nulos(NaN)

In [10]:
Data = {
    'A': [1, 2 , 4 , np.nan, 13],
    'B': [5, 3, np.nan, 6, 7],
    'c': [np.nan, 8 , 9, 10,11]
}
data = pd.DataFrame(Data)
print("DataFrame original:")
data

DataFrame original:

      A    B     c
0   1.0  5.0   NaN
1   2.0  3.0   8.0
2   4.0  NaN   9.0
3   NaN  6.0  10.0
4  13.0  7.0  11.0

Vamos a utilizar el dropna para que elimine las filas que tiene los valores nulos

In [11]:
data_sin_nulos = data.dropna()
print("\n Dataframe despues de eliminar valores nulos: ")
data_sin_nulos

 Dataframe despues de eliminar valores nulos:

      A    B     c
1   2.0  3.0   8.0
4  13.0  7.0  11.0

fillna: Rellena los datos que faltan con algún valor o utilizando un método de interpolación como ffill o bfill.
Para rellenar los valores nulos con un valor especifico, por ejemplo 0, podemos utilizar fillna de la siguiente manera:

In [12]:
data_fillnaa = data.fillna(0)
data_fillnaa

      A    B     c
0   1.0  5.0   0.0
1   2.0  3.0   8.0
2   4.0  0.0   9.0
3   0.0  6.0  10.0
4  13.0  7.0  11.0

isna(): dev8uelve valores boolenaos  que indican que valores faltan NA.

In [21]:
na_values = data.isna()
na_values

       A      B      c
0  False  False   True
1  False  False  False
2  False   True  False
3   True  False  False
4  False  False  False

Notna: Negación del isna, devuelve True para lods valores no NA y false para los valores NA

In [13]:
valores_nulos = data.notna()
valores_nulos

       A      B      c
0   True   True  False
1   True   True   True
2   True  False   True
3  False   True   True
4   True   True   True

Filtrar los datos que faltan 

Hay algunas formas de filtrar los datos que faltan. Aunque siempre se tiene la opción de hacerlo a mano usando pandas.isna() y la indexacion booleana, dropna() puede ser útil.En una Serie con sólo datos no nulos y los valores de indice:

In [15]:
data1 = pd.Series([np.nan, 4, 5.6, 8, np.nan])
data1.dropna()

1    4.0
2    5.6
3    8.0
dtype: float64

Esto es lo mismo hacer

In [17]:
data1[data1.notna()]

1    4.0
2    5.6
3    8.0
dtype: float64

Con los objetos DataFrame, hay diferentes formas de eliminar los datos que faltan. Es posible que desee eliminar las filas o columnas que son todas NA, o sólo las filas o columnas que contienen cualquier NA en absoluto. dropna() por defecto elimina cualquier fila que contenga un valor perdido:

In [34]:
data2 = pd.DataFrame([[2.,np.nan,8],[2.,np.nan,np.nan],[np.nan,np.nan,np.nan],[2,7.3, 8]])
data2

     0    1    2
0  2.0  NaN  8.0
1  2.0  NaN  NaN
2  NaN  NaN  NaN
3  2.0  7.3  8.0

In [35]:
data2.dropna()

     0    1    2
3  2.0  7.3  8.0

si se pasa how="all",solo se eliminan las filas que sean todas NA

In [36]:
data2.dropna(how="all")

     0    1    2
0  2.0  NaN  8.0
1  2.0  NaN  NaN
3  2.0  7.3  8.0

Tenga en cuenta que estas funciones devuelven nuevos objetos por defecto y no modifican el contenido del objeto original.

Para soltar (drop) columnas del mismo modo, pase axis="columns":

In [37]:
data2[4] = np.nan
data2

     0    1    2   4
0  2.0  NaN  8.0 NaN
1  2.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  2.0  7.3  8.0 NaN

In [39]:
data2.dropna(axis="columns",how="all")

     0    1    2
0  2.0  NaN  8.0
1  2.0  NaN  NaN
2  NaN  NaN  NaN
3  2.0  7.3  8.0

In [48]:
df = pd.DataFrame(np.random.standard_normal((6, 4)))

In [49]:
df

          0         1         2         3
0  0.580983 -2.068942 -0.940700 -0.882161
1  0.023720 -0.373413  0.893805  2.998860
2  0.508668 -0.018728  0.091248  0.628292
3  0.403889 -2.207507  1.195243 -0.707069
4  0.861577  0.620486 -0.507513 -2.492293
5  0.697189  0.115061 -0.069505 -1.647161

In [50]:
df.iloc[:3,3] = np.nan
df.iloc[:1,0] = np.nan

In [57]:
df

          0         1         2         3
0       NaN -2.068942 -0.940700       NaN
1  0.023720 -0.373413  0.893805       NaN
2  0.508668 -0.018728  0.091248       NaN
3  0.403889 -2.207507  1.195243 -0.707069
4  0.861577  0.620486 -0.507513 -2.492293
5  0.697189  0.115061 -0.069505 -1.647161

In [56]:
df.dropna()

          0         1         2         3
3  0.403889 -2.207507  1.195243 -0.707069
4  0.861577  0.620486 -0.507513 -2.492293
5  0.697189  0.115061 -0.069505 -1.647161

In [58]:
df.dropna(thresh=2)

          0         1         2         3
0       NaN -2.068942 -0.940700       NaN
1  0.023720 -0.373413  0.893805       NaN
2  0.508668 -0.018728  0.091248       NaN
3  0.403889 -2.207507  1.195243 -0.707069
4  0.861577  0.620486 -0.507513 -2.492293
5  0.697189  0.115061 -0.069505 -1.647161

Rellenar los datos que faltan
En lugar de filtrar los datos que faltan (y potencialmente descartar otros datos junto con ellos), es posible que desee rellenar los "huecos" de varias maneras. Para la mayoría de los propósitos, el método fillna() es la función a utilizar. Llamar a fillna() con una constante sustituye los valores que faltan por ese valor:

In [59]:
df

          0         1         2         3
0       NaN -2.068942 -0.940700       NaN
1  0.023720 -0.373413  0.893805       NaN
2  0.508668 -0.018728  0.091248       NaN
3  0.403889 -2.207507  1.195243 -0.707069
4  0.861577  0.620486 -0.507513 -2.492293
5  0.697189  0.115061 -0.069505 -1.647161

In [61]:
df.fillna(0)

          0         1         2         3
0  0.000000 -2.068942 -0.940700  0.000000
1  0.023720 -0.373413  0.893805  0.000000
2  0.508668 -0.018728  0.091248  0.000000
3  0.403889 -2.207507  1.195243 -0.707069
4  0.861577  0.620486 -0.507513 -2.492293
5  0.697189  0.115061 -0.069505 -1.647161

Llamando a fillna() con un diccionario, puede utilizar un valor de relleno diferente para cada columna:

In [62]:
df.fillna({0: 0.8, 3:0.5})

          0         1         2         3
0  0.800000 -2.068942 -0.940700  0.500000
1  0.023720 -0.373413  0.893805  0.500000
2  0.508668 -0.018728  0.091248  0.500000
3  0.403889 -2.207507  1.195243 -0.707069
4  0.861577  0.620486 -0.507513 -2.492293
5  0.697189  0.115061 -0.069505 -1.647161

Los mismos métodos de interpolación disponibles para la reindexación pueden utilizarse con fillna():

In [77]:
df2 = pd.DataFrame(np.random.standard_normal((6, 3)))

In [78]:
df2

          0         1         2
0 -2.434715  0.485410 -0.846446
1  1.196952  1.411604  1.769493
2  0.149190  1.178269  1.352162
3  0.774200 -2.293000  0.257258
4  0.172107  0.121981 -1.274220
5 -0.182964 -0.395684  0.985489

In [79]:
df2.iloc[1:, 0] = np.nan
df2.iloc[3:, 2] = np.nan
df2

          0         1         2
0 -2.434715  0.485410 -0.846446
1       NaN  1.411604  1.769493
2       NaN  1.178269  1.352162
3       NaN -2.293000       NaN
4       NaN  0.121981       NaN
5       NaN -0.395684       NaN

In [80]:
 df2.fillna(method="ffill")

C:\Users\nanaw\AppData\Local\Temp\ipykernel_13588\2736934224.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df2.fillna(method="ffill")

          0         1         2
0 -2.434715  0.485410 -0.846446
1 -2.434715  1.411604  1.769493
2 -2.434715  1.178269  1.352162
3 -2.434715 -2.293000  1.352162
4 -2.434715  0.121981  1.352162
5 -2.434715 -0.395684  1.352162

In [81]:
df2.fillna(method="ffill", limit=3)

C:\Users\nanaw\AppData\Local\Temp\ipykernel_13588\689661887.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df2.fillna(method="ffill", limit=3)

          0         1         2
0 -2.434715  0.485410 -0.846446
1 -2.434715  1.411604  1.769493
2 -2.434715  1.178269  1.352162
3 -2.434715 -2.293000  1.352162
4       NaN  0.121981  1.352162
5       NaN -0.395684  1.352162

Con fillna() puede hacer muchas otras cosas, como la imputación simple de datos utilizando la mediana o la media estadística:

In [84]:
data1 = pd.Series([3., 4, 3.5, np.nan, 8, np.nan])
data1

0    3.0
1    4.0
2    3.5
3    NaN
4    8.0
5    NaN
dtype: float64

In [85]:
data1.fillna(data1.mean())

0    3.000
1    4.000
2    3.500
3    4.625
4    8.000
5    4.625
dtype: float64

Funciones de argumento para fillna
value: Valor escalar u objeto tipo diccionario que se utilizará para rellenar los valores que faltan.
method: Método de interpolación: uno de "bfill" (relleno hacia atrás) o "ffill" (relleno hacia delante); por defecto es None
axis: Eje de relleno ("index" o "columns"); por defecto axis="index".
limit: Para el llenado hacia delante y hacia atrás, número máximo de periodos consecutivos a llenar

In [93]:
# DataFrame 
dfv = pd.DataFrame({
    'A': [1, 2, np.nan, 4],
    'B': [np.nan, 2, 3, 4]
})

dfv

     A    B
0  1.0  NaN
1  2.0  2.0
2  NaN  3.0
3  4.0  4.0

In [94]:
#Ejemplo Value
# Rellenar valores NaN con 0 utilizando va
dfv_filled = dfv.fillna(value=0)

dfv_filled

     A    B
0  1.0  0.0
1  2.0  2.0
2  0.0  3.0
3  4.0  4.0

In [95]:
# Rellenar valores NaN hacia atrás
df_bfill = dfv.fillna(method='bfill')

df_bfill

C:\Users\nanaw\AppData\Local\Temp\ipykernel_13588\4014001915.py:2: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df_bfill = dfv.fillna(method='bfill')

     A    B
0  1.0  2.0
1  2.0  2.0
2  4.0  3.0
3  4.0  4.0

In [96]:
df_filled_index = dfv.fillna(method='ffill', axis='index')

(df_filled_index)

C:\Users\nanaw\AppData\Local\Temp\ipykernel_13588\579530043.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df_filled_index = dfv.fillna(method='ffill', axis='index')

     A    B
0  1.0  NaN
1  2.0  2.0
2  2.0  3.0
3  4.0  4.0

Transformación de datos:Hasta ahora nos hemos ocupado de la gestión de los datos que faltan. El filtrado, la limpieza y otras transformaciones son otra clase de operaciones importantes.

### Remover duplicados
Pueden encontrarse filas duplicadas en un DataFrame por cualquier número de razones. He aquí un ejemplo:

In [105]:
# Crear un DataFrame de ejemplo
dfd = pd.DataFrame({
    'A': ["ana","pedro", "juan"] * 4 + ["ana"],
    'B': [5, 6, 6, 8,3,8,2,2,4,6,4,7,5]
})
dfd

        A  B
0     ana  5
1   pedro  6
2    juan  6
3     ana  8
4   pedro  3
5    juan  8
6     ana  2
7   pedro  2
8    juan  4
9     ana  6
10  pedro  4
11   juan  7
12    ana  5

In [106]:
dfd.duplicated()

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11    False
12     True
dtype: bool

En relación con esto, drop_duplicates devuelve un DataFrame con filas en las que se ha filtrado False el array duplicado:

In [107]:
dfd.drop_duplicates()

        A  B
0     ana  5
1   pedro  6
2    juan  6
3     ana  8
4   pedro  3
5    juan  8
6     ana  2
7   pedro  2
8    juan  4
9     ana  6
10  pedro  4
11   juan  7

Ambos métodos consideran por defecto todas las columnas; alternativamente, puede especificar cualquier subconjunto de ellas para detectar duplicados. Supongamos que tenemos una columna adicional de valores y queremos filtrar los duplicados basándonos sólo en la columna "B":

In [108]:
dfd

        A  B
0     ana  5
1   pedro  6
2    juan  6
3     ana  8
4   pedro  3
5    juan  8
6     ana  2
7   pedro  2
8    juan  4
9     ana  6
10  pedro  4
11   juan  7
12    ana  5

In [110]:
# Añadimos una tercera columna
dfd["C"] = range(13)
dfd

        A  B   C
0     ana  5   0
1   pedro  6   1
2    juan  6   2
3     ana  8   3
4   pedro  3   4
5    juan  8   5
6     ana  2   6
7   pedro  2   7
8    juan  4   8
9     ana  6   9
10  pedro  4  10
11   juan  7  11
12    ana  5  12

In [112]:
dfd.drop_duplicates(subset=["A"])

       A  B  C
0    ana  5  0
1  pedro  6  1
2   juan  6  2

In [114]:
dfd

        A  B   C
0     ana  5   0
1   pedro  6   1
2    juan  6   2
3     ana  8   3
4   pedro  3   4
5    juan  8   5
6     ana  2   6
7   pedro  2   7
8    juan  4   8
9     ana  6   9
10  pedro  4  10
11   juan  7  11
12    ana  5  12

In [113]:
dfd.drop_duplicates(subset=["B"])

        A  B   C
0     ana  5   0
1   pedro  6   1
3     ana  8   3
4   pedro  3   4
6     ana  2   6
8    juan  4   8
11   juan  7  11

duplicated y drop_duplicates mantienen por defecto la primera combinación de valores observada. Si se pasa keep="last" se devolverá la última.
El argumento keep puede tomar tres valores:

"first": (por defecto) Mantiene la primera aparición de una fila duplicada y elimina las subsecuentes.

"last": Mantiene la última aparición de una fila duplicada y elimina las anteriores.

"False": Elimina todas las filas duplicadas, no conservando ninguna.

In [115]:
# Crear un DataFrame 
data = pd.DataFrame({
    "k1": ["one", "two"] * 3 + ["two"],
    "k2": [1, 1, 2, 3, 3, 4, 4]
})

data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [117]:
# Identificar filas duplicadas, manteniendo la primera aparición
duplicados = data.duplicated(keep="first")
duplicados

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [118]:
# Eliminar filas duplicadas, manteniendo la primera aparición
data_sin_duplicados = data.drop_duplicates(keep="first")

data_sin_duplicados

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

last

In [120]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [119]:
# Identificar filas duplicadas, manteniendo la última aparición
duplicados = data.duplicated(keep="last")

print(duplicados)

0    False
1    False
2    False
3    False
4    False
5     True
6    False
dtype: bool

In [121]:
# Eliminar filas duplicadas, manteniendo la última aparición
data_sin_duplicados = data.drop_duplicates(keep="last")
data_sin_duplicados

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
6  two   4

"False"

In [123]:
# Identificar todas las filas duplicada
duplicados = data.duplicated(keep=False)

print(duplicados)

0    False
1    False
2    False
3    False
4    False
5     True
6     True
dtype: bool

In [124]:
# Eliminar todas las filas duplicadas
data_sin_duplicados = data.drop_duplicates(keep=False)

print(data_sin_duplicados)

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3

Transformación de datos mediante una Function o Mapping
Para muchos conjuntos de datos, es posible que desee realizar alguna transformación basada en los valores de un array, Serie o columna de un DataFrame. Considere los siguientes datos hipotéticos recogidos sobre varios tipos de :

In [129]:
#  DataFrame de fruits
dataf = pd.DataFrame({
    "frutas": ["manzana", "banano", "manzana", 
               "naranja", "banano","uva",
               "manzana", "naranja", "uva"],
    "kg": [4, 3, 5, 6, 2, 7, 8, 5, 6]
})

dataf

    frutas  kg
0  manzana   4
1   banano   3
2  manzana   5
3  naranja   6
4   banano   2
5      uva   7
6  manzana   8
7  naranja   5
8      uva   6

In [130]:
tipo_clima = {
  "manzana": "templado",
  "banano": "tripical",
  "naranja": "subtropical",
  "uva": "templado"
  }

In [131]:
dataf["clima"] = dataf["frutas"].map(tipo_clima)
dataf

    frutas  kg        clima
0  manzana   4     templado
1   banano   3     tripical
2  manzana   5     templado
3  naranja   6  subtropical
4   banano   2     tripical
5      uva   7     templado
6  manzana   8     templado
7  naranja   5  subtropical
8      uva   6     templado

También podríamos haber pasado una función que haga todo el trabajo:

In [132]:
def frutas(x):
    return tipo_clima[x]

dataf["clima"] = dataf["frutas"].map(tipo_clima)
dataf

    frutas  kg        clima
0  manzana   4     templado
1   banano   3     tripical
2  manzana   5     templado
3  naranja   6  subtropical
4   banano   2     tripical
5      uva   7     templado
6  manzana   8     templado
7  naranja   5  subtropical
8      uva   6     templado

Sustitución de valores

Rellenar los datos que faltan con el método fillna es un caso especial de sustitución de valores más general. Como ya se ha visto, map puede utilizarse para modificar un subconjunto de valores de un objeto, tambien replace proporciona una forma más sencilla y flexible de hacerlo. Consideremos esta serie:

In [133]:
data = pd.Series([17., 302., -500., 778., -500., 3.])
data

0     17.0
1    302.0
2   -500.0
3    778.0
4   -500.0
5      3.0
dtype: float64

Los valores -500 podrían ser valores centinela de datos perdidos. Para reemplazarlos por valores NA que pandas entienda, podemos usar replace, produciendo una nueva Serie:

In [135]:
data.replace(-500, np.nan)

0     17.0
1    302.0
2      NaN
3    778.0
4      NaN
5      3.0
dtype: float64

Si desea sustituir varios valores a la vez, debe pasar una lista y, a continuación, el valor sustituido:

In [137]:
data.replace([17, 3], np.nan)

0      NaN
1    302.0
2   -500.0
3    778.0
4   -500.0
5      NaN
dtype: float64

Para utilizar un sustituto diferente para cada valor, pase una lista de sustitutos:

In [139]:
data.replace([302, 17,-500], [np.nan, 0.5, 0])

0      0.5
1      NaN
2      0.0
3    778.0
4      0.0
5      3.0
dtype: float64

El argumento pasado también puede ser un diccionario:

In [140]:
data.replace({17: np.nan, 778: 0})

0      NaN
1    302.0
2   -500.0
3      0.0
4   -500.0
5      3.0
dtype: float64

El método data.replace() es distinto de data.str.replace, que realiza la sustitución de cadenas por elementos. Veremos estos métodos de cadena en Series más adelante.

### Renombrar índices de ejes
Al igual que los valores de una Serie, las etiquetas de los ejes pueden transformarse de forma similar mediante una función o un mapeo (mapping) de algún tipo para producir nuevos objetos etiquetados de forma diferente. También puede modificar los ejes in situ sin crear una nueva estructura de datos.

In [146]:
# Crear un DataFrame con 5 índices
data = pd.DataFrame(np.arange(20).reshape((5, 4)),
                    index=["Madrid", "Barcelona", "Valencia", "Sevilla", "Bilbao"],
                    columns=["A", "B", "C", "D"])

print(data)

            A   B   C   D
Madrid      0   1   2   3
Barcelona   4   5   6   7
Valencia    8   9  10  11
Sevilla    12  13  14  15
Bilbao     16  17  18  19

Al igual que una Serie, los índices de eje tienen un método map:

In [150]:
def transform(x):
    return x[:5].upper() 
data.index.map(transform)
#Index(["MADRI","BARCE","VALEN","SEVIL","BILBA"],dtype = 'object')

Index(['MADRI', 'BARCE', 'VALEN', 'SEVIL', 'BILBA'], dtype='object')

In [151]:
data

            A   B   C   D
Madrid      0   1   2   3
Barcelona   4   5   6   7
Valencia    8   9  10  11
Sevilla    12  13  14  15
Bilbao     16  17  18  19

Puede asignar al atributo de índice, modificando el DataFrame en su lugar:

In [153]:
data.index = data.index.map(transform)
data

        A   B   C   D
MADRI   0   1   2   3
BARCE   4   5   6   7
VALEN   8   9  10  11
SEVIL  12  13  14  15
BILBA  16  17  18  19

si desea crear una vesión transformada de un conjunto  de datos sin modificar  el original, un método util es rename:

In [155]:
data.rename(index=str.title, columns=str.lower)

        a   b   c   d
Madri   0   1   2   3
Barce   4   5   6   7
Valen   8   9  10  11
Sevil  12  13  14  15
Bilba  16  17  18  19

En particular renombrar puede utilizarse junto con un objeto tipo diccionario, proporcionando nuevos valores para un subconjunto  de las etiquetas de los ejes:

In [157]:
data.rename(index= {"BARCE":"Burgos"},
            columns={"A": "a"})

         a   B   C   D
MADRI    0   1   2   3
Burgos   4   5   6   7
VALEN    8   9  10  11
SEVIL   12  13  14  15
BILBA   16  17  18  19

Discretización y binning
La discretización y el binning son técnicas utilizadas en la preprocesamiento de datos para convertir datos continuos en discretos. Estas técnicas son útiles para reducir la variabilidad, agrupar datos similares y mejorar el rendimiento de algunos algoritmos de aprendizaje automático

Discretización.
Es el proceso de convertir datos continuos en datos categóricos dividiendo el rango de valores continuos en intervalos (bins).

Binning (Agrupación por intervalos)
El binning es una técnica de discretización que agrupa los datos en intervalos, o "bins".
Hay varios métodos para hacer binning en pandas, como el binning por frecuencia, el binning por longitud de intervalo y el binning basado en la cuantilación (por ejemplo Cuartil).

Los datos continuos suelen discretizarse o separarse en "intervalos" (bins) para su análisis. Supongamos que se dispone de datos sobre un grupo de personas en un estudio y desea agruparlas en grupos de edad discretos:

In [163]:
#Lista de alturas en metros
altura = [1.2, 1.5, 1.8, 1.3, 1.6, 1.9, 2.0, 1.4, 1.7, 2.4]

# Definir los intervalos(bin) de 1 a 1.5, 1.5 - 2.0, 2.0 - 2.5
bins = [1, 1.5, 2.0, 2.5]

# Se aplica pandas.cut para dividir por intervalos
alturas_categorias = pd.cut(altura, bins) 

alturas_categorias

[(1.0, 1.5], (1.0, 1.5], (1.5, 2.0], (1.0, 1.5], (1.5, 2.0], (1.5, 2.0], (1.5, 2.0], (1.0, 1.5], (1.5, 2.0], (2.0, 2.5]]
Categories (3, interval[float64, right]): [(1.0, 1.5] < (1.5, 2.0] < (2.0, 2.5]]

El objeto que pandas devuelve es un objeto Categorical especial. La salida que se ve describe los bins calculados por pandas.cut. Cada bin se identifica por un tipo de valor de intervalo especial (único en pandas) que contiene el límite inferior y superior de cada bin:

In [164]:
alturas_categorias.codes

array([0, 0, 1, 0, 1, 1, 1, 0, 1, 2], dtype=int8)

In [165]:
alturas_categorias.categories

IntervalIndex([(1.0, 1.5], (1.5, 2.0], (2.0, 2.5]], dtype='interval[float64, right]')

In [169]:
alturas_categorias.categories[1]

Interval(1.5, 2.0, closed='right')

In [170]:
pd.value_counts(alturas_categorias)

C:\Users\nanaw\AppData\Local\Temp\ipykernel_13588\2730282176.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(alturas_categorias)

(1.5, 2.0]    5
(1.0, 1.5]    4
(2.0, 2.5]    1
Name: count, dtype: int64

Tenga en cuenta que pd.value_counts(categories) son los recuentos bin del resultado de pandas.cut.

En la representación de cadena de un intervalo, un paréntesis significa que el lado está abierto (excluyente), mientras que el corchete significa que está cerrado (incluyente). Puede cambiar el lado cerrado pasando right=False

Puede anular el etiquetado de contenedores por defecto basado en intervalos pasando una lista o array a la opción labels:

In [171]:
grupos_alturas = ["Bajo", "Medio", "Alto",]
pd.cut(altura, bins, labels=grupos_alturas)

['Bajo', 'Bajo', 'Medio', 'Bajo', 'Medio', 'Medio', 'Medio', 'Bajo', 'Medio', 'Alto']
Categories (3, object): ['Bajo' < 'Medio' < 'Alto']

Consideremos el caso de unos datos distribuidos uniformemente y cortados en cuartos:

In [172]:
data = np.random.uniform(size = 25)
data

array([0.01918366, 0.77407561, 0.63390677, 0.04737066, 0.2964488 ,
       0.56821252, 0.27117095, 0.14298846, 0.19403771, 0.19221168,
       0.327964  , 0.32767786, 0.30294292, 0.31286398, 0.409309  ,
       0.32504216, 0.70109718, 0.66421242, 0.63477823, 0.17293268,
       0.87861775, 0.55255001, 0.95366291, 0.02223752, 0.7174445 ])

In [173]:
pd.cut(data, 6, precision = 3)
# el número 6 la cantidad de intervalos
# El 3 es la cantidad de números despues del punto

[(0.0182, 0.175], (0.642, 0.798], (0.486, 0.642], (0.0182, 0.175], (0.175, 0.331], ..., (0.798, 0.954], (0.486, 0.642], (0.798, 0.954], (0.0182, 0.175], (0.642, 0.798]]
Length: 25
Categories (6, interval[float64, right]): [(0.0182, 0.175] < (0.175, 0.331] < (0.331, 0.486] < (0.486, 0.642] < (0.642, 0.798] < (0.798, 0.954]]

La opción precision=3 limita la precisión decimal a tres dígitos distintos de cero.

Una función estrechamente relacionada, pandas.qcut, separa los datos basándose en los cuantiles de la muestra. Dependiendo de la distribución de los datos, el uso de pandas.cut no siempre resultará en que cada contenedor tenga el mismo número de puntos de datos. Dado que pandas.qcut utiliza los cuantiles de la muestra en su lugar, obtendrá intervalos de tamaño más o menos igual:

In [184]:
data = np.random.standard_normal(100)
data

array([-1.15489778,  1.15090916, -0.0984424 , -0.50077764, -0.97122243,
        1.40137905, -1.27285752,  0.31682353,  0.51087938, -0.17637976,
       -3.30835167,  0.75615665, -0.03383179, -0.61103919, -1.03556   ,
        1.98956988,  0.56940606, -1.38868653, -0.32965576,  1.30959524,
        0.797395  , -0.07799881,  1.63660385, -0.83711176,  0.93627729,
       -0.65923251, -0.18101039,  0.17783114, -0.36932265, -0.94978034,
        1.20039686,  0.31889273,  1.08847086,  0.51259668,  1.01260042,
       -1.11695691,  1.24916598,  1.78397315, -1.32749593, -0.18815238,
       -0.82301472,  0.86890049, -0.42891381,  0.62294927,  1.05388501,
       -0.42502743,  2.5254737 ,  0.00753604,  0.28012376, -1.20336966,
       -1.39256387,  1.39655696,  1.24886824, -0.69790244,  1.51147949,
       -0.32391851, -0.33916277, -0.16999391,  0.02638888, -0.70866544,
       -0.65436093, -0.87790636, -0.68161942,  0.41606593,  1.45136669,
       -2.34760759, -0.62543231, -0.92609325,  0.09508601, -0.49669677,
       -0.30589605, -1.62682721, -0.06271066,  1.16820936, -0.95808107,
       -0.81709002, -0.49684923,  0.9027784 ,  1.98612767, -1.73975661,
        0.704439  , -0.30828066,  0.94312229, -0.08322579,  1.06289835,
        1.29415692, -0.03760051, -0.92643055, -0.32328626, -0.76107266,
        1.16910008, -0.30051621, -0.66324142, -0.14926349, -0.9605212 ,
        0.33844256,  1.7378116 ,  0.62114478,  0.67604115, -1.82044921])

In [186]:
# Dividir los datos en 5 intervalos (quintiles) con precisión de 2 decimales
quartiles = pd.qcut(data, 5, precision = 2)

print(quartiles)

[(-3.32, -0.85], (1.06, 2.53], (-0.33, 0.22], (-0.85, -0.33], (-3.32, -0.85], ..., (0.22, 1.06], (1.06, 2.53], (0.22, 1.06], (0.22, 1.06], (-3.32, -0.85]]
Length: 100
Categories (5, interval[float64, right]): [(-3.32, -0.85] < (-0.85, -0.33] < (-0.33, 0.22] < (0.22, 1.06] < (1.06, 2.53]]

In [187]:
pd.value_counts(quartiles)

C:\Users\nanaw\AppData\Local\Temp\ipykernel_13588\3472704981.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(quartiles)

(-3.32, -0.85]    20
(-0.85, -0.33]    20
(-0.33, 0.22]     20
(0.22, 1.06]      20
(1.06, 2.53]      20
Name: count, dtype: int64

In [188]:
pd.Series(quartiles).value_counts()

(-3.32, -0.85]    20
(-0.85, -0.33]    20
(-0.33, 0.22]     20
(0.22, 1.06]      20
(1.06, 2.53]      20
Name: count, dtype: int64

De forma similar a pandas.cut, el usuario puede pasar sus propios cuantiles (números entre 0 y 1, ambos inclusive):

In [189]:
data

array([-1.15489778,  1.15090916, -0.0984424 , -0.50077764, -0.97122243,
        1.40137905, -1.27285752,  0.31682353,  0.51087938, -0.17637976,
       -3.30835167,  0.75615665, -0.03383179, -0.61103919, -1.03556   ,
        1.98956988,  0.56940606, -1.38868653, -0.32965576,  1.30959524,
        0.797395  , -0.07799881,  1.63660385, -0.83711176,  0.93627729,
       -0.65923251, -0.18101039,  0.17783114, -0.36932265, -0.94978034,
        1.20039686,  0.31889273,  1.08847086,  0.51259668,  1.01260042,
       -1.11695691,  1.24916598,  1.78397315, -1.32749593, -0.18815238,
       -0.82301472,  0.86890049, -0.42891381,  0.62294927,  1.05388501,
       -0.42502743,  2.5254737 ,  0.00753604,  0.28012376, -1.20336966,
       -1.39256387,  1.39655696,  1.24886824, -0.69790244,  1.51147949,
       -0.32391851, -0.33916277, -0.16999391,  0.02638888, -0.70866544,
       -0.65436093, -0.87790636, -0.68161942,  0.41606593,  1.45136669,
       -2.34760759, -0.62543231, -0.92609325,  0.09508601, -0.49669677,
       -0.30589605, -1.62682721, -0.06271066,  1.16820936, -0.95808107,
       -0.81709002, -0.49684923,  0.9027784 ,  1.98612767, -1.73975661,
        0.704439  , -0.30828066,  0.94312229, -0.08322579,  1.06289835,
        1.29415692, -0.03760051, -0.92643055, -0.32328626, -0.76107266,
        1.16910008, -0.30051621, -0.66324142, -0.14926349, -0.9605212 ,
        0.33844256,  1.7378116 ,  0.62114478,  0.67604115, -1.82044921])

In [190]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.]).value_counts()

(-3.3089999999999997, -1.16]    10
(-1.16, -0.124]                 40
(-0.124, 1.318]                 40
(1.318, 2.525]                  10
Name: count, dtype: int64

El segundo argumento [0, 0.1, 0.5, 0.9, 1.] especifica los puntos de corte para los cuantiles.
Estos puntos de corte son porcentajes que indican cómo se deben dividir los datos.

0 corresponde al valor mínimo.
0.1 corresponde al percentil 10 (el valor por debajo del cual se encuentra el 10% de los datos).
0.5 corresponde al percentil 50 (la mediana).
0.9 corresponde al percentil 90 (el valor por debajo del cual se encuentra el 90% de los datos).
1. corresponde al valor máximo.